{
  "format": "layers-model",
  "generatedBy": "keras v2.7.0",
  "convertedBy": "TensorFlow.js Converter v3.11.0",
  "modelTopology": {
    "keras_version": "2.7.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_7",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_25"
            },
            "name": "input_25",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_26"
            },
            "name": "input_26",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_24",
              "trainable": true,
              "batch_input_shape": [null, null],
              "dtype": "float32",
              "input_dim": 1683,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            },
            "name": "embedding_24",
            "inbound_nodes": [[["input_25", 0, 0, {}]]]
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_25",
              "trainable": true,
              "batch_input_shape": [null, null],
              "dtype": "float32",
              "input_dim": 944,
              "output_dim": 128,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            },
            "name": "embedding_25",
            "inbound_nodes": [[["input_26", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_8",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_8",
            "inbound_nodes": [[["embedding_24", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_9",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_9",
            "inbound_nodes": [[["embedding_25", 0, 0, {}]]]
          },
          {
            "class_name": "Dot",
            "config": {
              "name": "dot_11",
              "trainable": true,
              "dtype": "float32",
              "axes": 1,
              "normalize": false
            },
            "name": "dot_11",
            "inbound_nodes": [
              [
                ["dropout_8", 0, 0, {}],
                ["dropout_9", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_19",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "flatten_19",
            "inbound_nodes": [[["dot_11", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_7",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_7",
            "inbound_nodes": [[["flatten_19", 0, 0, {}]]]
          }
        ],
        "input_layers": [
          ["input_25", 0, 0],
          ["input_26", 0, 0]
        ],
        "output_layers": [["dense_7", 0, 0]]
      }
    },
    "training_config": {
      "loss": "mse",
      "metrics": null,
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adagrad",
        "config": {
          "name": "Adagrad",
          "learning_rate": 0.10000000149011612,
          "decay": 0.0,
          "initial_accumulator_value": 0.1,
          "epsilon": 1e-7
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_7/kernel", "shape": [16384, 1], "dtype": "float32" },
        { "name": "dense_7/bias", "shape": [1], "dtype": "float32" },
        {
          "name": "embedding_24/embeddings",
          "shape": [1683, 128],
          "dtype": "float32"
        },
        {
          "name": "embedding_25/embeddings",
          "shape": [944, 128],
          "dtype": "float32"
        }
      ]
    }
  ]
}

